BurgersFoam/tutorials/onedim_sine_wave_n/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1;
        startFace       7999;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          1;
        startFace       8000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    frontBackUpDown
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32000;
        startFace       8001;
    }
)

// ************************************************************************* //
