BurgersFoam/tutorials/onedim_sine_wave_n/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

defaultFieldValues
(
    volVectorFieldValue U (0. 0. 0.)
);

expressions
(
    U
    {
        field      U;
        dimensions [0 1 -1 0 0 0 0];
        expression
        #{
            (vector(sin(2*3.141592653*pos().x()/2), 0, 0))
        #};
    }
);